"""
Урок 3. Списки и словари
Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. В 
последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
*Пример:*
5
    1 2 3 4 5
    3
    -> 1
"""

length_list = int(input("Введите длину списка N: "))
input_list = []

for i in range(length_list):
    input_list.extend(input(f"Введите элемент списка {i}: "))

print(input_list)

x = input("Введите подсчитываемый элемент': ")
cnt_x = input_list.count(x)
print(cnt_x)