"""
*Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
В случае с английским алфавитом очки распределяются так:
A, E, I, O, U, L, N, S, T, R – 1 очко; 
D, G – 2 очка; 
B, C, M, P – 3 очка; 
F, H, V, W, Y – 4 очка; 
K – 5 очков; 
J, X – 8 очков; 
Q, Z – 10 очков. 
А русские буквы оцениваются так: 
А, В, Е, И, Н, О, Р, С, Т – 1 очко; 
Д, К, Л, М, П, У – 2 очка; 
Б, Г, Ё, Ь, Я – 3 очка; 
Й, Ы – 4 очка; 
Ж, З, Х, Ц, Ч – 5 очков; 
Ш, Э, Ю – 8 очков; 
Ф, Щ, Ъ – 10 очков. 
Напишите программу, которая вычисляет стоимость введенного пользователем слова. Будем считать, 
что на вход подается только одно слово, которое содержит либо только английские, либо только 
русские буквы.
*Пример:*
ноутбук
    12
"""
# =============================================================================
# =============================================================================

def fun(x):
    for key in scrabble_dict:
        if x in key:
            return scrabble_dict.get(key)

scrabble_dict = {
    # английский словарь
    'AEIOULNSTR' : 1,
    'DG' : 2, 
    'BCMP' : 3, 
    'FHVWY' : 4, 
    'K' : 5, 
    'JX' : 8, 
    'QZ' : 10
    # русский словарь
    ,
    'АВЕИНОРСТ' : 1, 
    'ДКЛМПУ' : 2, 
    'БГЁЬЯ' : 3, 
    'ЙЫ' : 4, 
    'ЖЗХЦЧ' : 5, 
    'ШЭЮ' : 8, 
    'ФЩЪ' : 10
    }

word_input = input('Введите слово: ')
word_upper = word_input.upper()

print(f'NOTEBOOK:', fun('NOTEBOOK'))
# print(f'A:', scrabble_dict.get("A"))
# # print(f'A:', scrabble_dict["A"]) # KeyError: 'A'
# print(f'K:', scrabble_dict.get("K"))

print(sum(map(fun, word_upper)))



# print('===')
# print(scrabble_dict)
# print('===')
# my_dict["key_3"] = 'a'

# print(my_dict.items())
# for k, v in my_dict.items(): # items - массив пар ключ + значение
#     print(k, v)              # keys - только ключи
#                              # values - только значения
for letter in word_upper:
    for key in scrabble_dict:
        if(letter) in key: #.keys():
            # print(scrabble_dict[key], end=" ")
            print(scrabble_dict.get(key))


# =============================================================================
# =============================================================================

# d = {"a": 1, "b": 2, "c": 3, "d": 4}
# rd = {}
# for k, v in d.items():
#     rd[v] = rd.get(v, []) + [k]
# print(rd)

# =============================================================================
# =============================================================================

# def fun(x):
#     for key in dct:
#         if x in key:
#             return dct.get(key)
# dct = {
#     'AEIOULNSTR' : 1, 'DG' : 2, 'BCMP' : 3,
#     'FHVWY' : 4, 'K' : 5, 'JX' : 8, 'QZ' :10
#     }
# print(sum(map(fun, input('Введите слово: '))))

# =============================================================================
# =============================================================================

# def cost(symb):
#     return [1,3,3,2,1,4,2,4,1,8,5,1,3,1,1,3,10,1,1,1,1,4,4,8,4,10][ ord( symb.lower() ) - ord('a') ]
# =============================================================================
# print( sum( cost(x) for x in input( '-> ' ) ) )

# =============================================================================
# =============================================================================

# import re
# s = input()
# d = {'[AEIOULNSTR]': '1', '[DG]': '2', '[BCMP]': '3', '[FHVWY]': '4', 'K': '5', '[JX]': '8', '[QZ]': '10'}
# for k in d:
#     s = re.sub(k, d[k], s)
# print(sum(map(int, s)))
# print('===')
# print(d)
# print('===')
